nxp-mcuxpresso/mcux-sdk/devices/LPC5514/LPC5514.h
#define FLASH_NMPA_GPO1_2_HVST_MASK              (0x1U)
#define FLASH_NMPA_GPO1_2_HVST_SHIFT             (0U)
/*! HVST - High Voltage Stress: 0=not done; 1=done.
 */
#define FLASH_NMPA_GPO1_2_HVST(x)                (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_2_HVST_SHIFT)) & FLASH_NMPA_GPO1_2_HVST_MASK)

#define FLASH_NMPA_GPO1_2_FIELD_MASK             (0xFFFFFFFEU)
#define FLASH_NMPA_GPO1_2_FIELD_SHIFT            (1U)
#define FLASH_NMPA_GPO1_2_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_2_FIELD_SHIFT)) & FLASH_NMPA_GPO1_2_FIELD_MASK)
/*! @} */

/*! @name GPO1_3 - GPO1 register 3 description */
/*! @{ */

#define FLASH_NMPA_GPO1_3_FIELD_MASK             (0xFFFFFFFFU)
#define FLASH_NMPA_GPO1_3_FIELD_SHIFT            (0U)
#define FLASH_NMPA_GPO1_3_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_3_FIELD_SHIFT)) & FLASH_NMPA_GPO1_3_FIELD_MASK)
/*! @} */

/*! @name GPO1_ARRAY - GPO1 array description */
/*! @{ */

#define FLASH_NMPA_GPO1_ARRAY_FIELD_MASK         (0xFFFFFFFFU)
#define FLASH_NMPA_GPO1_ARRAY_FIELD_SHIFT        (0U)
#define FLASH_NMPA_GPO1_ARRAY_FIELD(x)           (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO1_ARRAY_FIELD_SHIFT)) & FLASH_NMPA_GPO1_ARRAY_FIELD_MASK)
/*! @} */

/* The count of FLASH_NMPA_GPO1_ARRAY */
#define FLASH_NMPA_GPO1_ARRAY_COUNT              (4U)

/*! @name GPO2_0 - GPO2 register 0 description */
/*! @{ */

#define FLASH_NMPA_GPO2_0_USBHS_PHY_TRIM_VALID_MASK (0x1U)
#define FLASH_NMPA_GPO2_0_USBHS_PHY_TRIM_VALID_SHIFT (0U)
#define FLASH_NMPA_GPO2_0_USBHS_PHY_TRIM_VALID(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_USBHS_PHY_TRIM_VALID_SHIFT)) & FLASH_NMPA_GPO2_0_USBHS_PHY_TRIM_VALID_MASK)

#define FLASH_NMPA_GPO2_0_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK (0x6U)
#define FLASH_NMPA_GPO2_0_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT (1U)
#define FLASH_NMPA_GPO2_0_TRIM_USB_REG_ENV_TAIL_ADJ_VD(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_TRIM_USB_REG_ENV_TAIL_ADJ_VD_SHIFT)) & FLASH_NMPA_GPO2_0_TRIM_USB_REG_ENV_TAIL_ADJ_VD_MASK)

#define FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_D_CAL_MASK (0x78U)
#define FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_D_CAL_SHIFT (3U)
#define FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_D_CAL(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_D_CAL_SHIFT)) & FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_D_CAL_MASK)

#define FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DP_MASK (0xF80U)
#define FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DP_SHIFT (7U)
#define FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DP(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DP_SHIFT)) & FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DP_MASK)

#define FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DN_MASK (0x1F000U)
#define FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DN_SHIFT (12U)
#define FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DN(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DN_SHIFT)) & FLASH_NMPA_GPO2_0_TRIM_USBPHY_TX_CAL45DN_MASK)

#define FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_TST_MASK (0x60000U)
#define FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_TST_SHIFT (17U)
#define FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_TST(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_TST_SHIFT)) & FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_TST_MASK)

#define FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_VBGADJ_MASK (0x380000U)
#define FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_VBGADJ_SHIFT (19U)
#define FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_VBGADJ(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_VBGADJ_SHIFT)) & FLASH_NMPA_GPO2_0_TRIM_USB2_REFBIAS_VBGADJ_MASK)

#define FLASH_NMPA_GPO2_0_TRIM_PLL_CTRL0_DIV_SEL_MASK (0x1C00000U)
#define FLASH_NMPA_GPO2_0_TRIM_PLL_CTRL0_DIV_SEL_SHIFT (22U)
#define FLASH_NMPA_GPO2_0_TRIM_PLL_CTRL0_DIV_SEL(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_TRIM_PLL_CTRL0_DIV_SEL_SHIFT)) & FLASH_NMPA_GPO2_0_TRIM_PLL_CTRL0_DIV_SEL_MASK)

#define FLASH_NMPA_GPO2_0_FLASH_SIZE_MASK        (0xE000000U)
#define FLASH_NMPA_GPO2_0_FLASH_SIZE_SHIFT       (25U)
/*! FLASH_SIZE - (For Niobe4) 000 : 640 KB 001 : 512 KB 010 : 256 KB 011 : 128 KB 100 : 0 KB All
 *    others : RESERVED (For Niobe4 Mini) FLASH_SIZE[2:0] 000 : 256 KB 001 : 128 KB 010 : 80 KB
 *    (reserved) 011 : 64 KB 100 : 0 kB (reserved) All others : RESERVED
 */
#define FLASH_NMPA_GPO2_0_FLASH_SIZE(x)          (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_FLASH_SIZE_SHIFT)) & FLASH_NMPA_GPO2_0_FLASH_SIZE_MASK)

#define FLASH_NMPA_GPO2_0_CPU0_SECURITY_EXTENSION_DISABLE_MASK (0xF0000000U)
#define FLASH_NMPA_GPO2_0_CPU0_SECURITY_EXTENSION_DISABLE_SHIFT (28U)
/*! CPU0_SECURITY_EXTENSION_DISABLE - CPU0_SECURITY_EXTENSION_DISABLE[3:0]: 1010 : CPU0 Security
 *    Extension is disabled. All Other values: CPU0 Security Extension is enabled.
 */
#define FLASH_NMPA_GPO2_0_CPU0_SECURITY_EXTENSION_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_0_CPU0_SECURITY_EXTENSION_DISABLE_SHIFT)) & FLASH_NMPA_GPO2_0_CPU0_SECURITY_EXTENSION_DISABLE_MASK)
/*! @} */

/*! @name GPO2_1 - GPO2 register 1 description */
/*! @{ */

#define FLASH_NMPA_GPO2_1_FIELD_MASK             (0xFFFFFFFFU)
#define FLASH_NMPA_GPO2_1_FIELD_SHIFT            (0U)
#define FLASH_NMPA_GPO2_1_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_1_FIELD_SHIFT)) & FLASH_NMPA_GPO2_1_FIELD_MASK)
/*! @} */

/*! @name GPO2_2 - GPO2 register 2 description */
/*! @{ */

#define FLASH_NMPA_GPO2_2_FIELD_MASK             (0xFFFFFFFFU)
#define FLASH_NMPA_GPO2_2_FIELD_SHIFT            (0U)
#define FLASH_NMPA_GPO2_2_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_2_FIELD_SHIFT)) & FLASH_NMPA_GPO2_2_FIELD_MASK)
/*! @} */

/*! @name GPO2_3 - GPO2 register 3 description */
/*! @{ */

#define FLASH_NMPA_GPO2_3_FIELD_MASK             (0xFFFFFFFFU)
#define FLASH_NMPA_GPO2_3_FIELD_SHIFT            (0U)
#define FLASH_NMPA_GPO2_3_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_3_FIELD_SHIFT)) & FLASH_NMPA_GPO2_3_FIELD_MASK)
/*! @} */

/*! @name GPO2_ARRAY - GPO2 array description */
/*! @{ */

#define FLASH_NMPA_GPO2_ARRAY_FIELD_MASK         (0xFFFFFFFFU)
#define FLASH_NMPA_GPO2_ARRAY_FIELD_SHIFT        (0U)
#define FLASH_NMPA_GPO2_ARRAY_FIELD(x)           (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO2_ARRAY_FIELD_SHIFT)) & FLASH_NMPA_GPO2_ARRAY_FIELD_MASK)
/*! @} */

/* The count of FLASH_NMPA_GPO2_ARRAY */
#define FLASH_NMPA_GPO2_ARRAY_COUNT              (4U)

