nxp-mcuxpresso/mcux-sdk/devices/LPC5514/LPC5514.h
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFF_MASK (0x7C000000U)
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFF_SHIFT (26U)
/*! TOFF - Constant Off-Time calibration input.
 */
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFF(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFF_SHIFT)) & FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFF_MASK)

#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFFENABLE_MASK (0x80000000U)
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFFENABLE_SHIFT (31U)
/*! TOFFENABLE - Enable Constant Off-Time feature.
 */
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFFENABLE(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFFENABLE_SHIFT)) & FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_1_TOFFENABLE_MASK)
/*! @} */

/*! @name DCDC_POWER_PROFILE_MEDIUM_ARRAY -  */
/*! @{ */

#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY_FIELD_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY_FIELD_SHIFT (0U)
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY_FIELD(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY_FIELD_SHIFT)) & FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY_FIELD_MASK)
/*! @} */

/* The count of FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY */
#define FLASH_NMPA_DCDC_POWER_PROFILE_MEDIUM_ARRAY_COUNT (2U)

/*! @name BOD -  */
/*! @{ */

#define FLASH_NMPA_BOD_BOD_VBAT_TRIM_VALID_MASK  (0x1U)
#define FLASH_NMPA_BOD_BOD_VBAT_TRIM_VALID_SHIFT (0U)
#define FLASH_NMPA_BOD_BOD_VBAT_TRIM_VALID(x)    (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_BOD_BOD_VBAT_TRIM_VALID_SHIFT)) & FLASH_NMPA_BOD_BOD_VBAT_TRIM_VALID_MASK)

#define FLASH_NMPA_BOD_BOD_VBAT_TRIGLVL_MASK     (0x3EU)
#define FLASH_NMPA_BOD_BOD_VBAT_TRIGLVL_SHIFT    (1U)
#define FLASH_NMPA_BOD_BOD_VBAT_TRIGLVL(x)       (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_BOD_BOD_VBAT_TRIGLVL_SHIFT)) & FLASH_NMPA_BOD_BOD_VBAT_TRIGLVL_MASK)

#define FLASH_NMPA_BOD_BOD_VBAT_HYST_MASK        (0xC0U)
#define FLASH_NMPA_BOD_BOD_VBAT_HYST_SHIFT       (6U)
#define FLASH_NMPA_BOD_BOD_VBAT_HYST(x)          (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_BOD_BOD_VBAT_HYST_SHIFT)) & FLASH_NMPA_BOD_BOD_VBAT_HYST_MASK)

#define FLASH_NMPA_BOD_BOD_CORE_TRIM_VALID_MASK  (0x10000U)
#define FLASH_NMPA_BOD_BOD_CORE_TRIM_VALID_SHIFT (16U)
#define FLASH_NMPA_BOD_BOD_CORE_TRIM_VALID(x)    (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_BOD_BOD_CORE_TRIM_VALID_SHIFT)) & FLASH_NMPA_BOD_BOD_CORE_TRIM_VALID_MASK)

#define FLASH_NMPA_BOD_BOD_CORE_TRIGLVL_MASK     (0xE0000U)
#define FLASH_NMPA_BOD_BOD_CORE_TRIGLVL_SHIFT    (17U)
#define FLASH_NMPA_BOD_BOD_CORE_TRIGLVL(x)       (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_BOD_BOD_CORE_TRIGLVL_SHIFT)) & FLASH_NMPA_BOD_BOD_CORE_TRIGLVL_MASK)

#define FLASH_NMPA_BOD_BOD_CORE_HYST_MASK        (0x600000U)
#define FLASH_NMPA_BOD_BOD_CORE_HYST_SHIFT       (21U)
#define FLASH_NMPA_BOD_BOD_CORE_HYST(x)          (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_BOD_BOD_CORE_HYST_SHIFT)) & FLASH_NMPA_BOD_BOD_CORE_HYST_MASK)
/*! @} */

/*! @name LDO_AO -  */
/*! @{ */

#define FLASH_NMPA_LDO_AO_ACTIVE_TRIM_VALID_MASK (0x1U)
#define FLASH_NMPA_LDO_AO_ACTIVE_TRIM_VALID_SHIFT (0U)
#define FLASH_NMPA_LDO_AO_ACTIVE_TRIM_VALID(x)   (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_LDO_AO_ACTIVE_TRIM_VALID_SHIFT)) & FLASH_NMPA_LDO_AO_ACTIVE_TRIM_VALID_MASK)

#define FLASH_NMPA_LDO_AO_ACTIVE_TRIM_MASK       (0x3EU)
#define FLASH_NMPA_LDO_AO_ACTIVE_TRIM_SHIFT      (1U)
#define FLASH_NMPA_LDO_AO_ACTIVE_TRIM(x)         (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_LDO_AO_ACTIVE_TRIM_SHIFT)) & FLASH_NMPA_LDO_AO_ACTIVE_TRIM_MASK)

#define FLASH_NMPA_LDO_AO_DSLP_TRIM_VALID_MASK   (0x100U)
#define FLASH_NMPA_LDO_AO_DSLP_TRIM_VALID_SHIFT  (8U)
#define FLASH_NMPA_LDO_AO_DSLP_TRIM_VALID(x)     (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_LDO_AO_DSLP_TRIM_VALID_SHIFT)) & FLASH_NMPA_LDO_AO_DSLP_TRIM_VALID_MASK)

#define FLASH_NMPA_LDO_AO_DSLP_TRIM_MASK         (0x3E00U)
#define FLASH_NMPA_LDO_AO_DSLP_TRIM_SHIFT        (9U)
#define FLASH_NMPA_LDO_AO_DSLP_TRIM(x)           (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_LDO_AO_DSLP_TRIM_SHIFT)) & FLASH_NMPA_LDO_AO_DSLP_TRIM_MASK)

#define FLASH_NMPA_LDO_AO_PDWN_TRIM_VALID_MASK   (0x10000U)
#define FLASH_NMPA_LDO_AO_PDWN_TRIM_VALID_SHIFT  (16U)
#define FLASH_NMPA_LDO_AO_PDWN_TRIM_VALID(x)     (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_LDO_AO_PDWN_TRIM_VALID_SHIFT)) & FLASH_NMPA_LDO_AO_PDWN_TRIM_VALID_MASK)

#define FLASH_NMPA_LDO_AO_PDWN_TRIM_MASK         (0x3E0000U)
#define FLASH_NMPA_LDO_AO_PDWN_TRIM_SHIFT        (17U)
#define FLASH_NMPA_LDO_AO_PDWN_TRIM(x)           (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_LDO_AO_PDWN_TRIM_SHIFT)) & FLASH_NMPA_LDO_AO_PDWN_TRIM_MASK)

#define FLASH_NMPA_LDO_AO_DPDW_TRIM_VALID_MASK   (0x1000000U)
#define FLASH_NMPA_LDO_AO_DPDW_TRIM_VALID_SHIFT  (24U)
#define FLASH_NMPA_LDO_AO_DPDW_TRIM_VALID(x)     (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_LDO_AO_DPDW_TRIM_VALID_SHIFT)) & FLASH_NMPA_LDO_AO_DPDW_TRIM_VALID_MASK)

#define FLASH_NMPA_LDO_AO_DPDW_TRIM_MASK         (0x3E000000U)
#define FLASH_NMPA_LDO_AO_DPDW_TRIM_SHIFT        (25U)
#define FLASH_NMPA_LDO_AO_DPDW_TRIM(x)           (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_LDO_AO_DPDW_TRIM_SHIFT)) & FLASH_NMPA_LDO_AO_DPDW_TRIM_MASK)
/*! @} */

/*! @name SDIO_DELAY -  */
/*! @{ */

#define FLASH_NMPA_SDIO_DELAY_SDIO_0_VALID_MASK  (0x1U)
#define FLASH_NMPA_SDIO_DELAY_SDIO_0_VALID_SHIFT (0U)
#define FLASH_NMPA_SDIO_DELAY_SDIO_0_VALID(x)    (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_SDIO_DELAY_SDIO_0_VALID_SHIFT)) & FLASH_NMPA_SDIO_DELAY_SDIO_0_VALID_MASK)

#define FLASH_NMPA_SDIO_DELAY_SDIO_0_DELAY_MASK  (0x7FEU)
#define FLASH_NMPA_SDIO_DELAY_SDIO_0_DELAY_SHIFT (1U)
/*! SDIO_0_DELAY - SDIO_0_DELAY (unit: 100 ps).
 */
#define FLASH_NMPA_SDIO_DELAY_SDIO_0_DELAY(x)    (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_SDIO_DELAY_SDIO_0_DELAY_SHIFT)) & FLASH_NMPA_SDIO_DELAY_SDIO_0_DELAY_MASK)
/*! @} */

/*! @name AUX_BIAS_CURVE_AMBIENT_0 -  */
/*! @{ */

#define FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_0_MASK (0xFFFFU)
#define FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_0_SHIFT (0U)
/*! VREF1VCURVETRIM_0 - VREF1VCURVETRIM_0 (unit: 100uV)
 */
#define FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_0(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_0_SHIFT)) & FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_0_MASK)

#define FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_1_MASK (0xFFFF0000U)
#define FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_1_SHIFT (16U)
/*! VREF1VCURVETRIM_1 - VREF1VCURVETRIM_1 (unit: 100uV)
 */
#define FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_1(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_1_SHIFT)) & FLASH_NMPA_AUX_BIAS_CURVE_AMBIENT_0_VREF1VCURVETRIM_1_MASK)
/*! @} */

